Процедура ОтправитьСообщение(Client_id, ТекстСообщения,Кнопка = неопределено) Экспорт
	
	Ресурс = "bot" + Константы.BotToken.Получить() + "/sendMessage?chat_id=" + Формат(Client_id, "ЧГ=0") + "&text= " + ТекстСообщения;
	Если кнопка <> неопределено тогда
		Ресурс = Ресурс + Кнопка;
	конецесли;	
	ПроксиСервер = ПолучитьПрокси();
	Соединение  =  Новый HTTPСоединение(Константы.TelegramServer.Получить(),443,,,ПроксиСервер,10,Новый ЗащищенноеСоединениеOpenSSL());
	Запрос = Новый HTTPЗапрос(Ресурс);
	Ответ = Соединение.Получить(Запрос); 
	
КонецПроцедуры

Функция ПолучитьПрокси()
	
	ПроксиСервер = Новый ИнтернетПрокси;
	прПользователь = "JarovHuilo";
	прПароль = "xxQIlOmtkNrmjpm2";
	ПроксиСервер.Установить("https", "socks5://159.69.112.222",2007,прПользователь,прПароль);
	возврат ПроксиСервер
	
конецфункции
