
Функция ПолучитьЯзык(client_id) экспорт
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ЯзыкПользователя.client_id КАК client_id,
	               |	ЯзыкПользователя.Язык КАК Язык
	               |ИЗ
	               |	РегистрСведений.ЯзыкПользователя КАК ЯзыкПользователя
	               |ГДЕ
	               |	ЯзыкПользователя.client_id = &client_id";
	запрос.УстановитьПараметр("client_id",client_id);
	выборка = запрос.Выполнить().Выбрать();
	Если выборка.Следующий() тогда
		возврат выборка.Язык
	иначе
		возврат "RU"
	конецесли;	
конецфункции	