


Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДанныеЗаказов
	//Движения.ДанныеЗаказов.Записывать = Истина;
	//Движение = Движения.ДанныеЗаказов.Добавить();
	//Движение.Клиент = Клиент;
	//Движение.Курьер = Курьер;
	//Движение.Зона = Зона;
	//Движение.Статус = Статус;
	//Движение.ДатаНазначения = ДатаНазначения;
	//Движение.ДатаПриемаВРаботу = ДатаПриемаВРаботу;
	//Движение.ДатаЗавершения = ДатаЗавершения;

	Если Статус = Перечисления.СтатусыЗаказов.Принят Тогда
		
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			ТекстСообщения = "Order accepted, assigned number:" + Номер + "
			|Order price " + Сумма + "$";			
		иначе
			ТекстСообщения = "Заказ принят, присвоен номер:" + Номер + "
			|Сумма заказа " + Сумма;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.ВРаботе Тогда
		
		// Уведомляем клиента
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			ТекстСообщения = "Your order №" + Номер + " taken to work, courier " + Курьер;
		иначе
			ТекстСообщения = "Ваш заказ номер " + Номер + " взят в работу, курьер " + Курьер;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
		// Уведомляем курьера
		Если Тележка.ПолучитьЯзык(Курьер.client_id) = "EN" тогда
			ТекстСообщения = "Order №" + Номер + " taken to work" ;
		иначе
			ТекстСообщения = "Заказ номер " + Номер + " взят в работу" ;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Курьер.client_id, ТекстСообщения);
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Завершен Тогда
		
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			ТекстСообщения = "Your order №" + Номер + " delivered";
			
			КлавиатураВСообщении = "{""inline_keyboard"":[[{""text"": ""Order is not delivered"",""callback_data"": ""\/report" + Номер + """}]]}";
			ТекстСообщения = ТекстСообщения + "&reply_markup=" + КлавиатураВСообщении;
		иначе
			ТекстСообщения = "Ваш заказ номер " + Номер + " доставлен";
			
			КлавиатураВСообщении = "{""inline_keyboard"":[[{""text"": ""Заказ не доставлен"",""callback_data"": ""\/report" + Номер + """}]]}";
			ТекстСообщения = ТекстСообщения + "&reply_markup=" + КлавиатураВСообщении;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
		
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Отменен Тогда
		
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			// Уведомляем клиента
			ТекстСообщения = "Your order №" + Номер + " canceled";
		иначе
			// Уведомляем клиента
			ТекстСообщения = "Ваш заказ номер " + Номер + " отменен";
		конецесли;	
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
		Если Тележка.ПолучитьЯзык(Курьер.client_id) = "EN" тогда
			// Уведомляем курьера
			ТекстСообщения = "Order №" + Номер + " canceled";
		иначе
			// Уведомляем курьера
			ТекстСообщения = "Заказ номер " + Номер + " отменен";
		конецесли;
		
		
		Обработки.Telegram.ОтправитьСообщение(Курьер.client_id, ТекстСообщения);
		
		
	конецесли;
	
	//Обработки.Telegram.ОтправитьСообщение(Курьер.client_id, ТекстСообщения);
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыЗаказов.ВРаботе Тогда
		// Записываем дату приема в работу
		Если Не ЗначениеЗаполнено(ДатаПриемаВРаботу) Тогда
			ДатаПриемаВРаботу = ТекущаяДата();	
		КонецЕсли;
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Отменен ИЛИ 
		Статус = Перечисления.СтатусыЗаказов.Завершен Тогда
		Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
			ДатаЗавершения = ТекущаяДата();	
		КонецЕсли;
	КонецЕсли;
	
	// Расчет стоимости
	Если НЕ ЗначениеЗаполнено(Сумма) Тогда
		
		Сумма = Обработки.РасчетСтоимсотиЗаказа.Рассчитать(АдресОтправки, АдресДоставки);	
		
	КонецЕсли;

КонецПроцедуры




